* This is an org file to test block source of code
# Program to find out if the given number is even or not!
# Ask the user for a number. Depending on whether the number is even or odd, print out an
# appropriate message to the user. Hint: how does an even / odd number react differently when divided
# by 2?
# 
# Extras:
# 
# 1 If the number is a multiple of 4, print out a different message.
# 2 Ask the user for two numbers: one number to check (call it num) and one number to divide by
#  (check). If check divides evenly into num, tell that to the user. If not, print a different appropriate
#  message.
#+BEGIN_SRC python :session :exports none :tangle example1.py
	x = int(input('Enter an integer: '))
	if x%4 == 0:
	    print("%d is even and divisible by 4"%x)
	elif x%2 == 0:
	    print('%d is even'%x)
	else:
	    print('%d is odd'%x)
#+END_SRC

#+RESULTS:

#+name: ex1-code  
#+header: :var a="hello world"  
#+begin_src python :results verbatim replace output :exports results  
  print(a)  
#+end_src

#+RESULTS: ex1-code
: hello world

#+begin_src python :eval never :exports code :noweb yes   
  a = input('Value of a')  
  <<ex1-code>>  
#+end_src  


#+RESULTS:


# Extras coding
# Number divisibility by 4
